[{"title":"hexo博客yilia主题优化（一）增加网易云更贴","date":"2017-06-07T14:50:20.000Z","path":"hexo博客yilia主题优化（二）增加网易云更贴.html","text":"亲测有效，时间为2017.06.07。由于“多说”关闭，好用的评论插件寥寥无几了，搜狐的那个要网站备案，有点麻烦，索性就用网易云更贴吧。 第一步：注册网易云更贴注册链接：网易云更贴最后获得APP SDK 第二步：修改修改themes\\yilia\\layout\\_partial文件夹下的article.ejs文件,在最后加入: 1234567891011121314&lt;% if (!index &amp;&amp; post.comments &amp;&amp; config.wangYi)&#123; %&gt;&lt;section class=&quot;duoshuo&quot; id=&quot;comments&quot;&gt;&lt;div id=&quot;cloud-tie-wrapper&quot; class=&quot;cloud-tie-wrapper&quot;&gt;&lt;/div&gt;&lt;script&gt; var cloudTieConfig = &#123; url: document.location.href, sourceId: &quot;&quot;, productKey: &quot;&lt;%= config.wangYi%&gt;&quot;, target: &quot;cloud-tie-wrapper&quot; &#125;;&lt;/script&gt;&lt;script src=&quot;https:/img1_cache_netease_com/f2e/tie/yun/sdk/loader.js&quot;&gt;&lt;/script&gt;&lt;/section&gt;&lt;% &#125; %&gt; 第三步：配置在博客的配置文件_config.yml最后加入获取代码中的productKey 随便找个地方。 1wangYi: 06ab5cdc0b4cxxefb3xxxxxxxxxxxxx 大功告成PS：以上只用于yilia主题","tags":[{"name":"技术","slug":"技术","permalink":"http://readering.me/tags/技术/"}]},{"title":"hexo博客yilia主题优化（一）增加网站统计","date":"2017-06-07T13:50:20.000Z","path":"hexo博客yilia主题优化（一）增加网站统计.html","text":"亲测有效，时间为2017.06.07。我使用的为“不蒜子”，实现起来十分简单，小白容易上手。 第一步：安装脚本 使用“不蒜子”须在页面中引入busuanzi.js，目前最新版如下。 &lt;script async src=&quot;//dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js&quot;&gt; &lt;/script&gt; 对于我们hexo博客且使用yilia主题的小白来说，打开themes/yilia/layout/_partial/footer.ejs的最后添加上述脚本即可，当然你也可以添加到 header 中。下图： 第二步：安装标签只需要复制相应的html标签到你的网站要显示访问量的位置即可。您可以随意更改不蒜子标签为自己喜欢的显示效果，内容参考第三部分扩展开发。根据你要显示内容的不同，这分几种情况。 1.显示总访问量要显示站点总访问量，复制以下代码添加到你需要显示的位置。有两种算法可选： 算法a：pv的方式，单个用户连续点击n篇文章，记录n次访问量。 &lt;span id=&quot;busuanzi_container_site_pv&quot;&gt; 本站总访问量&lt;span id=&quot;busuanzi_value_site_pv&quot;&gt;&lt;/span&gt;次 &lt;/span&gt; 算法b：uv的方式，单个用户连续点击n篇文章，只记录1次访客数。 &lt;span id=&quot;busuanzi_container_site_uv&quot;&gt; 本站访客数&lt;span id=&quot;busuanzi_value_site_uv&quot;&gt;&lt;/span&gt;人次 &lt;/span&gt; 对于我们hexo博客，打开themes/yilia/layout/_partial/footer.ejs添加即可。如下图： 2.显示单页访问量要显示每篇文章的访问量，复制以下代码添加到你需要显示的位置。算法：pv的方式，单个用户点击1篇文章，本篇文章记录1次阅读量。 &lt;span id=&quot;busuanzi_container_page_pv&quot;&gt; 本文总阅读量&lt;span id=&quot;busuanzi_value_page_pv&quot;&gt;&lt;/span&gt;次 &lt;/span&gt; 3.显示总访问量和单页访问总量安装脚本，安装以上两种标签 Ps：代码文字部分均可改变，可以改成你所需要的总要保证id对的就行了。。。参考链接：http://ibruce.info/2015/04/04/busuanzi/","tags":[{"name":"技术","slug":"技术","permalink":"http://readering.me/tags/技术/"}]},{"title":"转载《拿什么来拯救你，我的乡村教育》","date":"2017-06-06T13:55:10.000Z","path":"20170606.html","text":"写在前言：最近又比较忙了，导师不停地催进度，学期末也是一大堆事。烦！深圳的夏天也到了，实验室本来是块清凉之地，但是空调坏了，室内温度30摄氏度，好气啊！（学校的中航物业真是养了群废物，报修N次，下次修不好，校长信箱见）Ｏ(≧口≦)Ｏ 额，sor，跑题啦，自从端午架设博客框架后，没来得及加其他功能（后续肯定会增加版块的），对以后的规划也没有（反正也没人看QAQ），现在随便写写吧，转一些有思想，有趣的东西。转载的来源么，墙外，或者1024吧。希望不会被查水表♪(^∇^*)。。。明天又是高考了，（唉，心中的一块痛。。。）转一篇关于教育的吧。 以下为正文：我曾经满怀梦想，大学毕业后义无反顾地来到农村中学，扎根农村教育。我任教的乡村中学，位于中国中部地区，人口稠密的江汉平原上。屈指一算，我工作已满二十年了。一个激情满怀的青年，到而今两鬓微霜的中年人，目睹了它的辉煌，经历着它的衰落。我一直热切地期盼着它强大，却眼睁睁地看着它渐渐地式微，无能为力。 我无力，因为我已成为弱势群体。 今年毕业二十周年的同学聚会，全班45人，实到二十人。来的同学，除我以外，都不是在农村中学当老师的。而我们当年就读的高等师范学校(现已更名为工程学院)，培养的目标就是农村中学老师。我们这个班，粗略地计算了一下，也就十来个人还在坚守在农村中学的讲台上。其他的同学，有的经商，有的从政，有的跳槽到了大城市……他们如今事业有成，在社会上有了自己的一席之地，经济上也没有后顾之忧，他们来母校聚会，基本上是属于衣锦还乡，春风得意。没来的那十几个同学，大都在农村中学教书，其中一个，已然病死在讲台上。作为农村教师中的一员，我理解他们的心情。他们大多对自己的现状是不满的，失望的，怀着些许“无颜见江东父老”的羞惭，还有不便直言的经济上的压力。 我当初是班级的团支部书记，班级聚会，实在不好意思推辞同学的邀请，不然，我也不会参加的。我多么希望我也能像我们的班长那样开着名车来，为亲爱的同学们豪掷买单，曾经“同朝为官”的他，早早下海经商，已然位居成功人士之列。前来聚会的，跳槽到南方城市任教的同学，尽管我们所用的教材是同一版本，可他的工资是我的四到五倍，我的每月工资，还抵不上他一个月的住房公积金。而且，他的副高职称早已按部就班地评上，因为名额充足，符合条件就上。我的副高职称，就目前来看，限于名额及不能明言的原因，还遥遥无期。这种现状，叫为生计奔波的农村老师如何提得起精神参加同学聚会？ 在向母校老师汇报成长经历的环节中，我没有想到我情不自禁的哽咽了，我不明白我怎么了，我用理智硬压下我胸腔中快要奔涌而出的热流，大而化之地对同学老师说：“我在农村中学生活得很充实，传播知识，教化蒙昧，也感受到了幸福……”这也确实是我的真心话。因为，献身教育事业一直是我的人生理想，我乐意教书，我不后悔我一直以来的选择，可是，为什么，为什么，我会落后同样起点的同学这么多，我不努力吗？我不尽责吗？我没有贡献吗？都不是！我莫名的哽咽，回想起来，那是委屈，那是我不愿面对和触碰的深深的委屈…… 难怪近年来，农村学校普遍出现了教师荒。边远地区的中小学更甚，我所在的乡镇，有一所学校的老师平均年龄达到了56岁，因为没有年轻的老师可以补充。我们这一代老师，是大学没扩招前的统招统分生，曾经是在千军万马过独木桥的竞争中的胜出者，也曾是同代人的榜样，但在经济地位决定一切的社会，白猫黑猫理论标准下，天之骄子的高大形象土崩瓦解，甚至成为“读书无用论”的活教材。新生代的年轻人，大都奉行的是“精致的利己主义”，很少有人愿意再做蜡烛、人梯、园丁了。牺牲自己成全他人是圣人的事，年轻一代早已不吃那一套。如今招收的老师，已不限一本或师范专业，不知，下限还会降到何种地步。而时时看到北京等城市中学招收的老师，清一色的清华北大硕士博士生。师资，是教育质量的关键一环，这叫以后的农村学子，拿什么去跟城市孩子竞争？ 我无力，因为农村教育生态已严重恶化。 首先，观念上，农村家长已不像以往一样重视读书，尊重老师。自从取消毕业分配后，农村家庭几乎倾家荡产，好不容易培养出一个大学生，遍宴宾客，热热闹闹送进大学，几年后，毕业即失业，家长及学生大失所望。如今家长的口头禅就是“读得进就读，读不进就不读，读了也冒得几大的用”！有的家长干脆说“老师，莫把我的伢逼狠了，我冒指望他读几大的书，在学校长几年身体，总不是个打工”。家长对读书轻慢的态度，让学生学习的动力和愿望大打折扣，学习不用心，不刻苦的现象增多。加上网吧、电脑游戏、手机的诱惑，课堂的吸引力日减。尽管老师使出浑身解数，却难以拉回讲台下神游别处的学生。也许，当乡村社会再次认识到读书的重要性时，情况会有所改观。 但目前，几千年传统的尊师重教之风，在乡村基本上破坏殆尽。我同事因为伸手教育一下学生，被家长这检查那检查，毫无问题却索赔检查费几千元。一个女老师，被男学生抓着头发在教室拖在地上拳打脚踢，学校还无权开除他，因为他有“未成年人法”的保护，家长也是有恃无恐，一味护子，连向受害老师道歉都勉强。老师没有惩罚学生的权利，学生违纪，只好请家长，大部分的家长打工去了，联系不上，年迈的祖父祖母，只是诉苦，管不住。 春节后开学，农村还在过年，老师趁家长在家去家访，家长忙着打麻将，不要说倒茶端凳子，连麻将桌都懒得下。更有个别溺爱孩子的家长，对老师管教孩子不满，在学校办公室抖狠说：“你个穷教书的算个屌，信不信我拿钱砸死你！”老师只有流下屈辱的泪。前几年房地产红火，在这个以建筑工为主的打工之乡，他们一天收入有的过千，最差的小工一天也有五六百，头脑活络的成为包工头，早已迈进百万千万富豪的行列。而此时老师的工资，每月大多数不足两千。对读书和教育的轻视，必然会导致整个社会文明的倒退。 社会治安事件的高发，社会道德的沦丧，这样的恶果，只会愈演愈烈！届时，不仅农村社会要为此买单，整个社会都逃不脱。因为，广大农村的青少年，也是未来城市的建设者。 第二，农村学生多为留守学生，与传统的农村孩子发生了很大的改变。以前的农村孩子，父母务农为主，孩子从小受到父母的照料，跟着父母学习干农活，往往具有热情淳朴，勤劳勇敢，吃苦耐劳的品格。现在的农村孩子，出生后就交给祖父祖母，亲生父母很少亲自参与养育，除非祖父母亡故。如果年轻的父母不去打工挣钱，却在家养娃，老人会说媳妇好吃懒做，在家没有经济来源，也无法生活。（我们这里的责任田人均只有几分地。）祖父母隔代抚养，常多溺爱，不舍得让孙女做家务，不舍得让孙子下地干活。儿子媳妇打工的钱源源不断地寄回家，老两口还要往往还要搭上自己打散工的钱，孙子孙女要什么买什么，只求不闹。这样的情况，往往养成孩子好吃任性，怕苦怕累，意志薄弱，眼高手低的个性特点。 第三，城镇化的过程中，乡村的没落必然影响到乡村学校。从规模来看，我所在的初中由高峰期的2000多学生，缩减到现在的400多学生。乡村小学也撤并了一半以上。这一方面是由于计划生育出生率的降低，另一方面也是由于到城市买房或打工的家庭把孩子转学去了城市。以前，一个年级11个班，每班近100个学生；现在，一个年级4个班，每班不到40个学生。近几年来，如雨后春笋般兴起的私立学校，疯狂抢夺本来就大幅萎缩的生源，使得乡镇中学的学生规模雪上加霜。听说有个兄弟乡镇中学开学后发现本乡的学生一半不知所踪，后来才知道都被私立学校挖走了。看局势，私立学校和公立乡镇学校的竞争将会在一个阶段长期存在，谁胜谁负，还得拭目以待，不敢妄论。 以上，是一个在乡镇中学工作了二十年的热血老师所亲历的农村教育。肯定缺乏高屋建瓴的理论反思，也肯定存在井底之蛙的眼光局限，但肯定是一个忧心农村教育的老师的良心之作。","tags":[{"name":"转载 1024","slug":"转载-1024","permalink":"http://readering.me/tags/转载-1024/"}]},{"title":"Hello World！","date":"2017-05-29T07:14:13.000Z","path":"Hello World！.html","text":"我很庆幸在毕业的时候选择了读研，也很庆幸选择了来到深圳。研究生的生活虽苦，但很少感觉到累。 有时有人问我：念了这么多年的书，不辛苦么？我说：每天都接触到新的东西，从未感觉累啊，我想日复一日，不断重复的工作，才是我所厌倦的吧！这次开个人博客，自己是小白，花了两天时间才搭建起来，调了N次bug，绞尽脑汁，但页面生成的那刻。。。无数感慨纷至沓来，就像游戏中升级一样，金光闪闪QAQ所以，我每天都像打开新世界的大门，对这个世界说：Hello World！","tags":[{"name":"有感而发","slug":"有感而发","permalink":"http://readering.me/tags/有感而发/"}]}]